# tetris/constants.py

# タイトル題字の定義
GAME_TITLE = "Tetris"

# テトリミノのパラメータを設定

CELL = 30
COLS = 10
ROWS = 20
SIDE = 220
WIDTH = COLS * CELL + SIDE
HEIGHT = ROWS * CELL

EMPTY = ""

# テトリミノの色を設定
COLORS = {
    "I": "#35c7ff",
    "L": "#f0a22e",
    "J": "#4f74ff",
    "O": "#f2d94e",
    "S": "#64d368",
    "T": "#a75be8",
    "Z": "#ef5a68",
}

# テトリミノの形を設定
SHAPES = {
    "I": [(0, 1), (1, 1), (2, 1), (3, 1)],
    "L": [(0, 0), (0, 1), (1, 1), (2, 1)],
    "J": [(2, 0), (0, 1), (1, 1), (2, 1)],
    "O": [(1, 0), (2, 0), (1, 1), (2, 1)],
    "S": [(1, 0), (2, 0), (0, 1), (1, 1)],
    "T": [(1, 0), (0, 1), (1, 1), (2, 1)],
    "Z": [(0, 0), (1, 0), (1, 1), (2, 1)],
}
